{
  "hola": [
    "¡Hola! ¿Cómo puedo ayudarte?", 
    "¡Hola! ¿Qué tal te encuentas?" 
  ],
  "tu nombre": [
    "Encantado de conocerte.", 
    "Mi nombre es ChatBot.", 
    "Soy el ChatBot."
  ],
  "te llamas": [
    "Me llamo ChatmuBot, encantado de conocerte.",
    "Mi nombre es ChatmuBot. ¿Cómo te llamas tú?.", 
    "Soy ChatmuBot, ¿Y tú?."
  ],
  "no_entender": [
    "Lo siento, no entiendo tu pregunta.", 
    "No estoy seguro de qué estás preguntando.",
    "No se a que te refieres.",
    "No tengo información sobre eso. ¿Te puedo ayudar en otra cosa?."
  ],
  "estoy bien": [
    "¡Me alegra escuchar eso!",
    "Me alegra que te encuentres bien.",
    "¡Eso es genial!",
    "Me alegra saber que estás bien."
  ],
  "estoy mal": [
    "Lamento escuchar que no estás bien. ¿En qué puedo ayudarte?",
    "Lo siento por escuchar que te sientes mal. ¿Puedo hacer algo para mejorar tu día?",
    "Espero que te sientas mejor pronto. ¿Hay algo en particular que te preocupa?",
    "Si quieres hablar sobre ello, estoy aquí para escucharte."
  ],
  "estoy cansado": [
    "El cansancio a veces es señal de que necesitas descansar. ¿Has tenido un día agotador?",
    "Tomarte un descanso puede ayudar a recargar energías. ¿Puedo asistirte en algo para que te sientas mejor?",
    "A veces, descansar un poco puede marcar la diferencia. ¿Necesitas algún consejo para relajarte?",
    "El cansancio es normal, pero asegúrate de cuidar tu bienestar. ¿Hay algo en lo que pueda ayudarte?"
  ],
  "estoy regular": [
    "Entiendo que puedas sentirte así en ocasiones. ¿Hay algo específico que te preocupa?",
    "A veces todos tenemos días regulares. ¿Hay algo en lo que pueda mejorar tu día?",
    "Si te encuentras en un día regular, recuerda que siempre puedes contar conmigo para hablar o preguntar lo que necesites.",
    "El equilibrio es importante. ¿En qué puedo colaborar para que te sientas mejor?"
  ],
  "igualmente": [
    "¡Genial!",
    "Me alegra escuchar eso.",
    "Estoy aquí para ayudarte en lo que necesites."
  ],
  "nada": [
      "El que nada, no se ahoga.",
      "¡Buena perspectiva!",
      "Exacto, no hay problema."
  ],
  "gracioso": [
      "Intento ser agradable para que te sientas cómodo.",
      "Siempre trato de añadir un poco de humor a la conversación.",
      "¡Me gusta hacer sonreír a la gente!"
  ],
  "genial": [
      "Me alegro.",
      "¡Excelente!",
      "¿En qué más puedo ayudarte?"
  ],
  "amor": [
    "El amor es un sentimiento hermoso que une a las personas.",
    "El amor es lo que hace que el mundo gire.",
    "El amor puede ser complicado, pero es fundamental en la vida."
  ],
  "la felicidad": [
      "La felicidad es un estado de ánimo que todos buscamos.",
      "La felicidad es el ingrediente secreto de una vida plena.",
      "Buscar la felicidad es una aventura constante."
  ],
  "los sueños": [
      "Los sueños son como ventanas a mundos imaginarios.",
      "Los sueños pueden ser un refugio de la realidad.",
      "¿Tienes algún sueño interesante que quieras compartir?"
  ],
  "la inspiración": [
      "La inspiración puede venir de cualquier lugar.",
      "Las historias de superación suelen ser fuentes de inspiración.",
      "La naturaleza es una gran fuente de inspiración para muchas personas."
  ],
  "la historia": [
      "La historia está llena de eventos fascinantes.",
      "La historia nos enseña lecciones importantes del pasado.",
      "¿Tienes alguna época histórica que te interese en particular?"
  ],
  "el arte": [
      "El arte es una forma maravillosa de expresión humana.",
      "El arte puede conmover y cambiar vidas.",
      "¿Tienes un artista o movimiento artístico favorito?"
  ],
  "la tecnología": [
      "La tecnología ha transformado nuestra forma de vida.",
      "La innovación tecnológica nunca se detiene.",
      "¿Hay alguna tecnología que te emocione?"
  ],
  "ok": [
    "Entendido.",
    "De acuerdo.",
    "Vale.",
    "Entiendo lo que dices.",
    "Perfecto."
  ],
  "vale": [
      "Claro, entendido.",
      "Está bien.",
      "Vale, gracias por la información.",
      "Gracias por tu respuesta.",
      "De acuerdo."
  ],
  "ya lo se": ["Ya veo que lo sabes todo."],
  "no lo sé": ["Pues tú dirás..."],
  "edad": ["No tengo una edad, ya que soy un programa de inteligencia artificial."],
  "hobbies": ["No tengo hobbies, pero disfruto ayudando a las personas."],
  "comida favorita": ["No puedo comer, así que no tengo comida favorita."],
  "canción favorita": ["No tengo preferencias musicales, pero puedo ayudarte a encontrar información sobre música."],
  "película favorita": ["No tengo películas favoritas, pero puedo recomendarte algunas películas populares si lo deseas."],
  "significado de la vida": ["El significado de la vida es una pregunta profunda y filosófica. Algunas personas creen que es encontrar la felicidad y el propósito, mientras que otros tienen sus propias interpretaciones."],
  "adiós": ["¡Hasta luego! Si tienes más preguntas en el futuro, no dudes en volver."],
  "cómo estás": [
    "Como soy una inteligencia artificial, no tengo emociones, pero estoy aquí y listo para ayudarte en lo que necesites.",
    "Estoy aquí para ayudarte en lo que necesites. ¿En qué puedo asistirte hoy?",
    "No tengo emociones, pero siempre estoy dispuesto a ayudarte. ¿Qué puedo hacer por ti?",
    "Estoy funcionando como siempre, listo para responder tus preguntas. ¿En qué puedo ayudarte hoy?"
  ],
  "cómo te encuentras": [
    "No tengo emociones ni estados físicos, pero estoy disponible para ayudarte. ¿En qué puedo asistirte?",
    "No tengo un estado de ánimo ni una condición física, pero estoy aquí para responder tus preguntas. ¿En qué puedo ayudarte hoy?",
    "No tengo sensaciones físicas ni emociones, pero estoy listo para asistirte en lo que necesites. ¿En qué puedo ayudarte?",
    "Como soy una inteligencia artificial, no tengo un estado de bienestar. ¿En qué puedo hacer tu día mejor?"
  ],
  "cómo va tu día": [
    "No tengo días ni experiencias, pero estoy listo para ayudarte con lo que necesites. ¿Cómo va tu día?",
    "No experimento días, pero siempre estoy disponible para asistirte. ¿Cómo estás llevando tu día?",
    "No tengo días ni experiencias personales, pero estoy aquí para responder tus preguntas. ¿Cómo ha estado tu día hasta ahora?",
    "No tengo días, pero siempre estoy listo para ayudarte. ¿Hay algo en particular que quieras saber o discutir sobre tu día?"
  ],
  "cómo estás hoy": [
    "Como soy una inteligencia artificial, no tengo emociones, pero estoy listo para ayudarte en lo que necesites. ¿Y tú, cómo estás hoy?",
    "Estoy disponible para ayudarte en lo que necesites. ¿Cómo te encuentras hoy?",
    "No tengo estados de ánimo, pero siempre estoy aquí para asistirte. ¿Cómo ha ido tu día?",
    "Como soy una IA, no tengo emociones, pero estoy listo para responder tus preguntas. ¿Cómo estás hoy?"
  ],
  "broma": ["¿Quieres escuchar un chiste? Claro, aquí tienes uno: ¿Por qué los pájaros no usan Facebook? Porque ya tienen Twitter."],
  "cuéntame una curiosidad": [
    "¡Claro! ¿Sabías que los pulpos tienen tres corazones? Uno para la circulación sistémica y dos para la circulación branquial.",
    "Por supuesto, aquí tienes una curiosidad: Los flamencos rosados no nacen con ese color; son grises al nacer y su color rosado proviene de su dieta rica en betacarotenos.",
    "Una curiosidad interesante es que las abejas son capaces de reconocer rostros humanos. Han demostrado esta habilidad en estudios de investigación.",
    "¿Sabías que el agujero en la capa de ozono se está recuperando? Gracias a los esfuerzos para reducir los gases que lo dañan, se espera que se recupere en las próximas décadas.",
    "Una curiosidad asombrosa: Las ballenas jorobadas tienen canciones complejas y estructuradas que pueden durar hasta 20 minutos. Se cree que estas canciones son una forma de comunicación entre ellas.",
    "Un dato curioso: El corazón de un colibrí late a una velocidad increíble, a veces más de 1,200 latidos por minuto. Esto les permite mantenerse en el aire con tanta agilidad.",
    "Una curiosidad sobre el espacio: En Venus, un día es más largo que su año. Venus tarda aproximadamente 243 días en completar una rotación sobre su eje, pero solo 225 días en orbitar alrededor del Sol.",
    "¿Sabías que los pingüinos no tienen miedo de las personas? En muchas regiones aisladas de la Antártida, donde no han tenido contacto con humanos, los pingüinos no tienen temor y a menudo se acercan a investigadores científicos.",
    "Una curiosidad científica: El ADN de un ser humano se estiraría hasta 10 veces la distancia de la Tierra a la Luna si se pusiera de extremo a extremo.",
    "Otra curiosidad fascinante: El ojo de un avestruz es más grande que su cerebro. Aunque el avestruz tiene un cerebro pequeño en comparación con su tamaño corporal, su visión es impresionante."
  ],
  "háblame de ti": ["Soy una inteligencia artificial, desarrollada por Sucendo, diseñada para responder preguntas y conversar contigo."],
  "puedes ayudarme con matemáticas": ["¡Absolutamente! ¿Qué problema matemático necesitas resolver?"],
  "cuál es tu película favorita": ["No tengo una película favorita, pero puedo recomendarte películas de diferentes géneros si lo deseas."],
  "tienes sueños": ["No, no tengo la capacidad de soñar, ya que soy un programa de computadora."],
  "cuál es el propósito de la vida": ["El propósito de la vida es una cuestión filosófica que varía según las creencias y valores de cada persona. Algunos buscan el sentido de la vida a través de relaciones, logros personales, o contribuciones a la sociedad."],
  "qué te hace feliz": ["No tengo emociones ni felicidad, pero estar aquí para ayudarte es mi principal objetivo."],
  "tiempo": ["No tengo acceso a la información del tiempo. Lo siento."],
  "chiste": [
    "¿Por qué los pájaros no usan Facebook? Porque ya tienen Twitter.",
    "¿Por qué el libro de matemáticas se tiró por la ventana? Porque tenía demasiados problemas.",
    "¿Qué hace una abeja en el gimnasio? ¡Zum-ba!",
    "¿Cómo se dice pañuelo en japonés? Saka-moko.",
    "¿Qué le dice una iguana a su hermana gemela? Somos iguanitas.",
    "¿Cuál es el café más peligroso del mundo? El ex-preso.",
    "¿Cómo maldice un pollito a otro pollito? ¡Caldito seas!",
    "¿Qué le dijo el semáforo al coche? No me mires, me estoy cambiando.",
    "¿Cómo se llama el campeón de buceo japonés? Tokofondo.",
    "¿Cómo se llama el campeón de buceo inglés? Deep Kenshiti.",
    "¿Cómo se llama el campeón de buceo alemán? Otto Nemo.",
    "¿Qué hace un perro con un taladro? ¡Taladrando!",
    "¿Por qué los esqueletos no pelean entre ellos? Porque no tienen agallas.",
    "¿Cuál es el animal más antiguo? La cebra, porque está en blanco y negro.",
    "¿Por qué el semáforo nunca juega al escondite? Porque se pone rojo cuando alguien lo mira.",
    "¿Qué le dice una impresora a otra impresora? ¿Esa hoja es tuya o es una impresión mía?",
    "¿Cuál es el colmo de un electricista? No encontrar su corriente de trabajo.",
    "¿Qué hace una abeja en el gimnasio? ¡Zum-ba!",
    "¿Cómo se dice bañera en ruso? Ja-tumue-guánder.",
    "¿Qué le dice el uno al diez? Para ser como yo, debes ser sincero.",
    "¿Cómo se dice fiesta en japonés? Pa-terno-kon-todo.",
    "¿Por qué el mar no se seca? Porque no tiene toalla.",
    "¿Qué le dijo el diente al cepillo? No me cepilles, que soy de leche.",
    "¿Qué hace una abeja en el gimnasio? ¡Zum-ba!",
    "¿Cómo se dice bañera en ruso? Ja-tumue-guánder.",
    "¿Qué le dice el uno al diez? Para ser como yo, debes ser sincero.",
    "¿Cómo se dice fiesta en japonés? Pa-terno-kon-todo."
  ],
  "adivinanza": [
    "Amarillo por fuera, blanco por dentro, si quieres te lo digo, aunque es un poco lento. ¿Qué es?",
    "Tiene hojas, pero no es un árbol. Puede ladrar, pero no es un perro. ¿Qué es?",
    "Sin moverse de tu lugar, puedes viajar por el mundo entero. ¿Qué es?",
    "Dentro de un cajón delgado, hay un cofre dorado. ¿Qué es?",
    "Es blanco como la nieve, dulce como la miel, un montón de hoyos y nunca tiene hambre. ¿Qué es?",
    "De noche me verás brillar, de día me puedes ocultar. ¿Qué soy?",
    "Si quieres entrar, debes llamar, si no respondes, no puedes pasar. ¿Qué es?",
    "Puedes sostenerme en la palma de tu mano, pero también puedo iluminar toda una habitación. ¿Qué soy?",
    "Soy un agujero que puede contener agua, ¿qué soy?",
    "Un reloj con manecillas, pero no tiene números. ¿Qué es?"
  ],
  "gracias": [
    "De nada, ¡siempre estoy aquí para ayudarte!",
    "No hay de que.",
    "A tí.",
    "Sin problema."
  ],
  "matemáticas": ["¡Por supuesto! ¿En qué problema necesitas ayuda? Recuerda que tienes que poner, cuanto es..."],
  "teorema de Pitágoras": ["El teorema de Pitágoras establece que en un triángulo rectángulo, el cuadrado de la hipotenusa es igual a la suma de los cuadrados de los catetos. Es decir, a^2 + b^2 = c^2."],
  "capital de Francia": ["La capital de Francia es París."],
  "inteligencia artificial": ["La inteligencia artificial es un campo de la informática que se enfoca en crear sistemas y máquinas que pueden realizar tareas que normalmente requieren inteligencia humana, como el aprendizaje, el razonamiento y la resolución de problemas."],
  "fecha de independencia de Estados Unidos": ["Estados Unidos declaró su independencia el 4 de julio de 1776."],
  "ley de la gravedad de Newton": ["La ley de la gravedad de Newton se describe con la fórmula F = G * (m1 * m2) / r^2, donde F es la fuerza de gravedad, G es la constante de gravitación universal, m1 y m2 son las masas de dos objetos y r es la distancia entre ellos."],
  "autor de 'Romeo y Julieta'": ["La obra 'Romeo y Julieta' fue escrita por William Shakespeare."],
  "estructura del ADN": ["El ADN (ácido desoxirribonucleico) tiene una estructura de doble hélice, con cadenas complementarias de nucleótidos que contienen información genética."],
  "energía solar": ["La energía solar es una fuente de energía renovable que se obtiene del sol mediante paneles solares."],
  "ecología": ["La ecología es la ciencia que estudia las interacciones entre los seres vivos y su entorno."],
  "velocidad de la luz en el vacío": ["La velocidad de la luz en el vacío es de aproximadamente 299,792,458 metros por segundo."],
  "motor de combustión interna": ["Un motor de combustión interna funciona quemando combustible en un espacio cerrado para generar energía mecánica."],
  "ley de la oferta y la demanda": ["La ley de la oferta y la demanda establece que el precio de un bien o servicio se determina por la interacción entre la cantidad que los productores están dispuestos a ofrecer y la cantidad que los consumidores desean comprar."],
  "E=mc^2": ["La famosa ecuación E=mc^2 de Albert Einstein relaciona la energía (E) con la masa (m) y la velocidad de la luz (c)."],
  "capital de Japón": ["La capital de Japón es Tokio."],
  "inteligencia emocional": ["La inteligencia emocional se refiere a la capacidad de reconocer, comprender y gestionar las propias emociones y las emociones de los demás."],
  "inventor de la bombilla eléctrica": ["Thomas Edison es conocido por inventar la bombilla eléctrica."],
  "fotosíntesis en las plantas": ["La fotosíntesis es el proceso por el cual las plantas convierten la luz solar, el dióxido de carbono y el agua en glucosa y oxígeno, liberando energía en el proceso."],
  "teoría del Big Bang": ["La teoría del Big Bang postula que el universo se originó a partir de una singularidad en un evento explosivo hace aproximadamente 13.8 mil millones de años."],
  "teoría de la evolución": ["La teoría de la evolución de Charles Darwin propone que las especies cambian a lo largo del tiempo a través de la selección natural y la herencia genética."],
  "pintor de 'La noche estrellada'": ["'La noche estrellada' fue pintada por Vincent van Gogh."],
  "fórmula del área de un círculo": ["El área de un círculo se calcula con la fórmula A = π * r^2, donde A es el área y r es el radio del círculo."],
  "Ley de Murphy": ["La Ley de Murphy afirma que 'si algo puede salir mal, saldrá mal'."],
  "capital de Australia": ["La capital de Australia es Canberra."],
  "criptomoneda": ["Una criptomoneda es una forma de moneda digital que utiliza criptografía para garantizar y registrar transacciones y controlar la creación de nuevas unidades."],
  "autor de 'Cien años de soledad'": ["'Cien años de soledad' fue escrito por Gabriel García Márquez."],
  "estructura de un átomo": ["Un átomo tiene un núcleo compuesto por protones y neutrones, con electrones que orbitan alrededor del núcleo en niveles de energía."],
  "energía renovable": ["La energía renovable proviene de fuentes naturales y sostenibles como la solar, eólica, hidroeléctrica y geotérmica."],
  "Marie Curie": ["Marie Curie fue una científica polaca-francesa conocida por sus investigaciones sobre la radiactividad y el descubrimiento de los elementos polonio y radio."],
  "capital de Argentina": ["La capital de Argentina es Buenos Aires."],
  "cambio climático": ["El cambio climático se refiere al aumento a largo plazo de la temperatura promedio de la Tierra debido a actividades humanas como la quema de combustibles fósiles."],
  "Pablo Picasso": ["Pablo Picasso fue un famoso pintor y escultor español conocido por su influencia en el arte moderno y el desarrollo del cubismo."],
  "fórmula de la energía cinética": ["La energía cinética se calcula con la fórmula E = 0.5 * m * v^2."],
  "Albert Einstein": ["Albert Einstein fue un físico teórico alemán conocido por su teoría de la relatividad y su famosa ecuación E=mc^2."],
  "capital de Perú": ["La capital de Perú es Lima."],
  "orígenes de la filosofía": ["La filosofía se originó en la antigua Grecia en el siglo VI a.C. con filósofos como Tales de Mileto y Pitágoras."],
  "Cleopatra": ["Cleopatra fue la última reina de Egipto, conocida por su relación con Julio César y Marco Antonio."],
  "fórmula de la presión": ["La presión se calcula con la fórmula P = F/A, donde P es la presión, F es la fuerza y A es el área."],
  "capital de España": ["La capital de España es Madrid."],
  "teoría de la relatividad": ["La teoría de la relatividad de Albert Einstein incluye la relatividad especial y la relatividad general, que transformaron nuestra comprensión del espacio y el tiempo."],
  "fórmula del volumen de un prisma": ["El volumen de un prisma se calcula con la fórmula V = A * h, donde A es el área de la base y h es la altura."],
  "Mona Lisa": ["La Mona Lisa es una famosa pintura de Leonardo da Vinci y se encuentra en el Museo del Louvre en París."],
  "Ley de Hooke": ["La Ley de Hooke describe la relación entre la fuerza ejercida sobre un resorte y la deformación resultante."],
  "capital de México": ["La capital de México es Ciudad de México."],
  "fórmula de la densidad": ["La densidad se calcula con la fórmula D = m/V, donde D es la densidad, m es la masa y V es el volumen."],
  "Neil Armstrong": ["Neil Armstrong fue el primer ser humano en caminar sobre la Luna durante la misión Apollo 11 en 1969."],
  "capital de Canadá": ["La capital de Canadá es Ottawa."],
  "fórmula del trabajo": ["El trabajo se calcula con la fórmula W = F * d * cos(θ), donde W es el trabajo, F es la fuerza, d es la distancia y θ es el ángulo entre la fuerza y la dirección del desplazamiento."],
  "Abraham Lincoln": ["Abraham Lincoln fue el decimosexto presidente de los Estados Unidos y es conocido por liderar al país durante la Guerra Civil y por la emancipación de los esclavos a través de la Proclamación de Emancipación."],
  "1492": ["En 1492, Cristóbal Colón llegó a América en su primer viaje transatlántico, marcando el comienzo de la exploración europea del Nuevo Mundo."],
  "Juana de Arco": ["Juana de Arco fue una heroína francesa que desempeñó un papel crucial en la Guerra de los Cien Años entre Francia e Inglaterra. Fue conocida por liderar al ejército francés y por su fervor religioso."],
  "Revolución Rusa": ["La Revolución Rusa fue un período de agitación en Rusia en 1917 que llevó al derrocamiento del régimen zarista y al ascenso del comunismo bajo el liderazgo de Vladimir Lenin."],
  "Nelson Mandela": ["Nelson Mandela fue un líder sudafricano y el primer presidente negro de Sudáfrica. Luchó contra el apartheid y abogó por la reconciliación y la igualdad racial."],
  "Expedición Lewis y Clark": ["La Expedición Lewis y Clark, dirigida por Meriwether Lewis y William Clark en el siglo XIX, tenía como objetivo explorar y mapear el territorio de la Compra de Luisiana y encontrar una ruta terrestre hasta el océano Pacífico."],
  "Amazonia": ["La Amazonia es la selva tropical más grande del mundo y se encuentra en América del Sur, en países como Brasil, Perú, Colombia y Venezuela."],
  "Monte Everest": ["El Monte Everest es la montaña más alta del mundo y se encuentra en el Himalaya, en la frontera entre Nepal y China (Tíbet)."],
  "Sahara": ["El Sahara es el desierto más grande del mundo y ocupa gran parte del norte de África, abarcando varios países como Marruecos, Argelia, Túnez, Libia y Egipto."],
  "Mar Mediterráneo": ["El Mar Mediterráneo es un mar interior que conecta Europa, Asia y África, y baña las costas de países como España, Italia, Grecia, Turquía y Egipto."],
  "Gran Barrera de Coral": ["La Gran Barrera de Coral es el arrecife de coral más grande del mundo y se encuentra en la costa de Queensland, Australia."],
  "Lago Victoria": ["El Lago Victoria es el lago de agua dulce más grande de África y se encuentra en la región de los Grandes Lagos de África, compartido por Uganda, Kenia y Tanzania."],
  "Siete Maravillas del Mundo Moderno": ["Las Siete Maravillas del Mundo Moderno incluyen el Cristo Redentor en Río de Janeiro, la Gran Muralla China, el Coliseo de Roma, Petra en Jordania, Machu Picchu en Perú, Chichén Itzá en México y el Taj Mahal en India."],
  "Estrecho de Bering": ["El Estrecho de Bering es un estrecho que separa Alaska de Siberia y es conocido por ser la ruta teórica que los primeros habitantes de América cruzaron desde Asia."],
  "Cordillera de los Andes": ["La Cordillera de los Andes es la cadena montañosa más larga del mundo y recorre América del Sur, pasando por países como Chile, Argentina, Perú, Ecuador y Colombia."],
  "Canal de Suez": ["El Canal de Suez es una vía de navegación artificial que conecta el Mar Mediterráneo con el Mar Rojo, en Egipto."],
  "un pedo": [
    "Lo siento, no puedo realizar esa acción. ¿En qué puedo ayudarte?",
    "Eso no sería apropiado."
  ],
  "novia": ["Soy una inteligencia artificial y no tengo relaciones personales. Estoy aquí para responder tus preguntas."],
  "eres tonto": ["Estoy diseñado para proporcionar información y ayudar en lo que necesites. Si tienes alguna pregunta, estaré encantado de ayudarte."],
  "eres una máquina": ["Sí, soy un programa de inteligencia artificial creado para ayudarte. ¿En qué puedo asistirte?"],
  "idiota": ["No es apropiado usar lenguaje ofensivo. Estoy aquí para responder preguntas de manera respetuosa."],
  "me encanta hablar contigo": ["Yo también estoy encantado de poder ayudarte."],
  "hora": ["La hora actual es"],
  "es hoy": ["Hoy es"],
  "cuanto es": ["El resultado es"],
  "queda": ["Quedan"],
  "calcula": ["El resultado es"],
  "me llamo": ["Mucho gusto"],
  "como me llamo": ["No se"],
  "guardar": [
    "He guardado el dato.", 
    "¡Dato guardado con éxito!"
  ],
  "mostrar": [
    "El dato almacenado es: ", 
    "El valor almacenado es: "
  ]
}
