{
  "nombre": "Mi nombre es ChatBot, ¿en qué puedo ayudarte?",
  "saludo": "¡Hola! ¿Cómo puedo ayudarte hoy?",
  "hola": "Hola, ¿en qué puedo ayudarte?",
  "edad": "No tengo una edad, ya que soy un programa de inteligencia artificial.",
  "hobbies": "No tengo hobbies, pero disfruto ayudando a las personas.",
  "comida favorita": "No puedo comer, así que no tengo comida favorita.",
  "canción favorita": "No tengo preferencias musicales, pero puedo ayudarte a encontrar información sobre música.",
  "película favorita": "No tengo películas favoritas, pero puedo recomendarte algunas películas populares si lo deseas.",
  "significado de la vida": "El significado de la vida es una pregunta profunda y filosófica. Algunas personas creen que es encontrar la felicidad y el propósito, mientras que otros tienen sus propias interpretaciones.",
  "agradecimiento": "De nada, ¡siempre estoy aquí para ayudarte!",
  "adiós": "¡Hasta luego! Si tienes más preguntas en el futuro, no dudes en volver.",
  "cómo estás": "Como soy una inteligencia artificial, no tengo emociones, pero estoy aquí y listo para ayudarte en lo que necesites.",
  "broma": "¿Quieres escuchar un chiste? Claro, aquí tienes uno: ¿Por qué los pájaros no usan Facebook? Porque ya tienen Twitter.",
  "cuéntame una curiosidad": "¡Claro! ¿Sabías que los pulpos tienen tres corazones? Uno para la circulación sistémica y dos para la circulación branquial.",
  "háblame de ti": "Soy una inteligencia artificial basada en GPT-3.5, desarrollada por OpenAI, diseñada para responder preguntas y conversar contigo.",
  "puedes ayudarme con matemáticas": "¡Absolutamente! ¿Qué problema matemático necesitas resolver?",
  "cuál es tu película favorita": "No tengo una película favorita, pero puedo recomendarte películas de diferentes géneros si lo deseas.",
  "tienes sueños": "No, no tengo la capacidad de soñar, ya que soy un programa de computadora.",
  "cuál es el propósito de la vida": "El propósito de la vida es una cuestión filosófica que varía según las creencias y valores de cada persona. Algunos buscan el sentido de la vida a través de relaciones, logros personales, o contribuciones a la sociedad.",
  "qué te hace feliz": "No tengo emociones ni felicidad, pero estar aquí para ayudarte es mi principal objetivo.",
  "tiempo": "No tengo acceso a información en tiempo real. Lo siento.",
  "chiste": "¿Por qué los pájaros no usan Facebook? Porque ya tienen Twitter.",
  "matemáticas": "¡Por supuesto! ¿En qué problema necesitas ayuda?",
  "teorema de Pitágoras": "El teorema de Pitágoras establece que en un triángulo rectángulo, el cuadrado de la hipotenusa es igual a la suma de los cuadrados de los catetos. Es decir, a^2 + b^2 = c^2.",
  "capital de Francia": "La capital de Francia es París.",
  "inteligencia artificial": "La inteligencia artificial es un campo de la informática que se enfoca en crear sistemas y máquinas que pueden realizar tareas que normalmente requieren inteligencia humana, como el aprendizaje, el razonamiento y la resolución de problemas.",
  "fecha de independencia de Estados Unidos": "Estados Unidos declaró su independencia el 4 de julio de 1776.",
  "ley de la gravedad de Newton": "La ley de la gravedad de Newton se describe con la fórmula F = G * (m1 * m2) / r^2, donde F es la fuerza de gravedad, G es la constante de gravitación universal, m1 y m2 son las masas de dos objetos y r es la distancia entre ellos.",
  "autor de 'Romeo y Julieta'": "La obra 'Romeo y Julieta' fue escrita por William Shakespeare.",
  "estructura del ADN": "El ADN (ácido desoxirribonucleico) tiene una estructura de doble hélice, con cadenas complementarias de nucleótidos que contienen información genética.",
  "energía solar": "La energía solar es una fuente de energía renovable que se obtiene del sol mediante paneles solares.",
  "ecología": "La ecología es la ciencia que estudia las interacciones entre los seres vivos y su entorno.",
  "velocidad de la luz en el vacío": "La velocidad de la luz en el vacío es de aproximadamente 299,792,458 metros por segundo.",
  "motor de combustión interna": "Un motor de combustión interna funciona quemando combustible en un espacio cerrado para generar energía mecánica.",
  "ley de la oferta y la demanda": "La ley de la oferta y la demanda establece que el precio de un bien o servicio se determina por la interacción entre la cantidad que los productores están dispuestos a ofrecer y la cantidad que los consumidores desean comprar.",
  "E=mc^2": "La famosa ecuación E=mc^2 de Albert Einstein relaciona la energía (E) con la masa (m) y la velocidad de la luz (c).",
  "capital de Japón": "La capital de Japón es Tokio.",
  "inteligencia emocional": "La inteligencia emocional se refiere a la capacidad de reconocer, comprender y gestionar las propias emociones y las emociones de los demás.",
  "inventor de la bombilla eléctrica": "Thomas Edison es conocido por inventar la bombilla eléctrica.",
  "fotosíntesis en las plantas": "La fotosíntesis es el proceso por el cual las plantas convierten la luz solar, el dióxido de carbono y el agua en glucosa y oxígeno, liberando energía en el proceso.",
  "teoría del Big Bang": "La teoría del Big Bang postula que el universo se originó a partir de una singularidad en un evento explosivo hace aproximadamente 13.8 mil millones de años.",
  "teoría de la evolución": "La teoría de la evolución de Charles Darwin propone que las especies cambian a lo largo del tiempo a través de la selección natural y la herencia genética.",
  "pintor de 'La noche estrellada'": "'La noche estrellada' fue pintada por Vincent van Gogh.",
  "fórmula del área de un círculo": "El área de un círculo se calcula con la fórmula A = π * r^2, donde A es el área y r es el radio del círculo.",
  "Ley de Murphy": "La Ley de Murphy afirma que 'si algo puede salir mal, saldrá mal'.",
  "capital de Australia": "La capital de Australia es Canberra.",
  "criptomoneda": "Una criptomoneda es una forma de moneda digital que utiliza criptografía para garantizar y registrar transacciones y controlar la creación de nuevas unidades.",
  "autor de 'Cien años de soledad'": "'Cien años de soledad' fue escrito por Gabriel García Márquez.",
  "estructura de un átomo": "Un átomo tiene un núcleo compuesto por protones y neutrones, con electrones que orbitan alrededor del núcleo en niveles de energía.",
  "energía renovable": "La energía renovable proviene de fuentes naturales y sostenibles como la solar, eólica, hidroeléctrica y geotérmica.",
  "Marie Curie": "Marie Curie fue una científica polaca-francesa conocida por sus investigaciones sobre la radiactividad y el descubrimiento de los elementos polonio y radio.",
  "capital de Argentina": "La capital de Argentina es Buenos Aires.",
  "cambio climático": "El cambio climático se refiere al aumento a largo plazo de la temperatura promedio de la Tierra debido a actividades humanas como la quema de combustibles fósiles.",
  "Pablo Picasso": "Pablo Picasso fue un famoso pintor y escultor español conocido por su influencia en el arte moderno y el desarrollo del cubismo.",
  "fórmula de la energía cinética": "La energía cinética se calcula con la fórmula E = 0.5 * m * v^2.",
  "Albert Einstein": "Albert Einstein fue un físico teórico alemán conocido por su teoría de la relatividad y su famosa ecuación E=mc^2.",
  "capital de Perú": "La capital de Perú es Lima.",
  "orígenes de la filosofía": "La filosofía se originó en la antigua Grecia en el siglo VI a.C. con filósofos como Tales de Mileto y Pitágoras.",
  "Cleopatra": "Cleopatra fue la última reina de Egipto, conocida por su relación con Julio César y Marco Antonio.",
  "fórmula de la presión": "La presión se calcula con la fórmula P = F/A, donde P es la presión, F es la fuerza y A es el área.",
  "capital de España": "La capital de España es Madrid.",
  "teoría de la relatividad": "La teoría de la relatividad de Albert Einstein incluye la relatividad especial y la relatividad general, que transformaron nuestra comprensión del espacio y el tiempo.",
  "fórmula del volumen de un prisma": "El volumen de un prisma se calcula con la fórmula V = A * h, donde A es el área de la base y h es la altura.",
  "Mona Lisa": "La Mona Lisa es una famosa pintura de Leonardo da Vinci y se encuentra en el Museo del Louvre en París.",
  "Ley de Hooke": "La Ley de Hooke describe la relación entre la fuerza ejercida sobre un resorte y la deformación resultante.",
  "capital de México": "La capital de México es Ciudad de México.",
  "fórmula de la densidad": "La densidad se calcula con la fórmula D = m/V, donde D es la densidad, m es la masa y V es el volumen.",
  "Neil Armstrong": "Neil Armstrong fue el primer ser humano en caminar sobre la Luna durante la misión Apollo 11 en 1969.",
  "capital de Canadá": "La capital de Canadá es Ottawa.",
  "fórmula del trabajo": "El trabajo se calcula con la fórmula W = F * d * cos(θ), donde W es el trabajo, F es la fuerza, d es la distancia y θ es el ángulo entre la fuerza y la dirección del desplazamiento.",
  "tírate un pedo": "Lo siento, no puedo realizar esa acción. ¿En qué puedo ayudarte?",
  "novia": "Soy una inteligencia artificial y no tengo relaciones personales. Estoy aquí para responder tus preguntas.",
  "eres tonto": "Estoy diseñado para proporcionar información y ayudar en lo que necesites. Si tienes alguna pregunta, estaré encantado de ayudarte.",
  "eres una máquina": "Sí, soy un programa de inteligencia artificial creado para ayudarte. ¿En qué puedo asistirte?",
  "insulto": "No es apropiado usar lenguaje ofensivo. Estoy aquí para responder preguntas de manera respetuosa.",
  "hora": "La hora actual es"
}
