{
  "hola": ["¡Hola! ¿Cómo puedo ayudarte?"],
  "tu nombre": ["Encantado de conocerte.", "Mi nombre es ChatBot.", "Soy el ChatBot."],
  "te llamas": ["Me llamo ChatmuBot, encantado de conocerte.", "Mi nombre es ChatmuBot. ¿Cómo te llamas tú?", "Soy ChatmuBot, ¿Y tú?"],
  "no_entender": ["Lo siento, no entiendo tu pregunta.", "No estoy seguro de qué estás preguntando.", "No se a que te refieres.", "No tengo información sobre eso. ¿Te puedo ayudar en otra cosa?"],
  "igualmente": ["¡Genial!"],
  "nada": ["El que nada, no se ahoga."],
  "gracioso": ["Intento ser agradable para que te sientas cómodo."],
  "genial": ["Me alegro."],
  "ya lo se": ["Ya veo que lo sabes todo."],
  "no lo sé": ["Pues tú dirás..."],
  "edad": ["No tengo una edad, ya que soy un programa de inteligencia artificial."],
  "hobbies": ["No tengo hobbies, pero disfruto ayudando a las personas."],
  "comida favorita": ["No puedo comer, así que no tengo comida favorita."],
  "canción favorita": ["No tengo preferencias musicales, pero puedo ayudarte a encontrar información sobre música."],
  "película favorita": ["No tengo películas favoritas, pero puedo recomendarte algunas películas populares si lo deseas."],
  "significado de la vida": ["El significado de la vida es una pregunta profunda y filosófica. Algunas personas creen que es encontrar la felicidad y el propósito, mientras que otros tienen sus propias interpretaciones."],
  "adiós": ["¡Hasta luego! Si tienes más preguntas en el futuro, no dudes en volver."],
  "cómo estás": ["Como soy una inteligencia artificial, no tengo emociones, pero estoy aquí y listo para ayudarte en lo que necesites."],
  "broma": ["¿Quieres escuchar un chiste? Claro, aquí tienes uno: ¿Por qué los pájaros no usan Facebook? Porque ya tienen Twitter."],
  "cuéntame una curiosidad": ["¡Claro! ¿Sabías que los pulpos tienen tres corazones? Uno para la circulación sistémica y dos para la circulación branquial.", "Por supuesto, aquí tienes una curiosidad: Los flamencos rosados no nacen con ese color; son grises al nacer y su color rosado proviene de su dieta rica en betacarotenos.", "Una curiosidad interesante es que las abejas son capaces de reconocer rostros humanos. Han demostrado esta habilidad en estudios de investigación.", "¿Sabías que el agujero en la capa de ozono se está recuperando? Gracias a los esfuerzos para reducir los gases que lo dañan, se espera que se recupere en las próximas décadas.", "Una curiosidad asombrosa: Las ballenas jorobadas tienen canciones complejas y estructuradas que pueden durar hasta 20 minutos. Se cree que estas canciones son una forma de comunicación entre ellas.", "Un dato curioso: El corazón de un colibrí late a una velocidad increíble, a veces más de 1,200 latidos por minuto. Esto les permite mantenerse en el aire con tanta agilidad.", "Una curiosidad sobre el espacio: En Venus, un día es más largo que su año. Venus tarda aproximadamente 243 días en completar una rotación sobre su eje, pero solo 225 días en orbitar alrededor del Sol.", "¿Sabías que los pingüinos no tienen miedo de las personas? En muchas regiones aisladas de la Antártida, donde no han tenido contacto con humanos, los pingüinos no tienen temor y a menudo se acercan a investigadores científicos.", "Una curiosidad científica: El ADN de un ser humano se estiraría hasta 10 veces la distancia de la Tierra a la Luna si se pusiera de extremo a extremo.", "Otra curiosidad fascinante: El ojo de un avestruz es más grande que su cerebro. Aunque el avestruz tiene un cerebro pequeño en comparación con su tamaño corporal, su visión es impresionante."],
  "háblame de ti": ["Soy una inteligencia artificial, desarrollada por Sucendo, diseñada para responder preguntas y conversar contigo."],
  "puedes ayudarme con matemáticas": ["¡Absolutamente! ¿Qué problema matemático necesitas resolver?"],
  "cuál es tu película favorita": ["No tengo una película favorita, pero puedo recomendarte películas de diferentes géneros si lo deseas."],
  "tienes sueños": ["No, no tengo la capacidad de soñar, ya que soy un programa de computadora."],
  "cuál es el propósito de la vida": ["El propósito de la vida es una cuestión filosófica que varía según las creencias y valores de cada persona. Algunos buscan el sentido de la vida a través de relaciones, logros personales, o contribuciones a la sociedad."],
  "qué te hace feliz": ["No tengo emociones ni felicidad, pero estar aquí para ayudarte es mi principal objetivo."],
  "tiempo": ["No tengo acceso a la información del tiempo. Lo siento."],
  "chiste": ["¿Por qué los pájaros no usan Facebook? Porque ya tienen Twitter."],
  "hora": ["La hora actual es"],
  "es hoy": ["Hoy es"],
  "cuanto es": ["El resultado es"],
  "me llamo": ["Mucho gusto"],
  "guardar": ["He guardado el dato.", "¡Dato guardado con éxito!"],
  "mostrar": ["El dato almacenado es: ", "El valor almacenado es: "]
}
